###############################################################################
# Created by write_sdc
# Thu Apr 20 11:25:01 2023
###############################################################################
current_design cpu
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 100.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[0]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[10]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[11]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[12]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[13]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[14]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[15]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[16]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[17]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[18]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[19]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[1]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[20]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[21]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[22]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[23]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[24]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[25]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[26]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[27]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[28]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[29]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[2]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[30]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[31]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[32]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[33]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[34]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[35]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[36]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[37]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[38]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[39]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[3]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[40]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[41]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[42]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[43]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[44]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[45]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[46]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[47]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[48]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[49]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[4]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[50]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[51]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[52]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[53]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[54]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[55]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[56]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[57]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[58]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[59]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[5]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[60]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[61]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[62]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[63]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[6]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[7]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[8]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext[9]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[0]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[10]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[11]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[12]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[13]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[14]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[15]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[16]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[17]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[18]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[19]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[1]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[20]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[21]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[22]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[23]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[24]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[25]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[26]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[27]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[28]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[29]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[2]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[30]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[31]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[32]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[33]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[34]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[35]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[36]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[37]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[38]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[39]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[3]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[40]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[41]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[42]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[43]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[44]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[45]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[46]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[47]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[48]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[49]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[4]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[50]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[51]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[52]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[53]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[54]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[55]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[56]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[57]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[58]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[59]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[5]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[60]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[61]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[62]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[63]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[6]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[7]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[8]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_ext_2[9]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {arst_n}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {enable}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ren_ext}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ren_ext_2}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[0]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[10]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[11]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[12]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[13]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[14]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[15]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[16]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[17]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[18]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[19]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[1]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[20]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[21]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[22]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[23]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[24]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[25]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[26]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[27]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[28]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[29]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[2]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[30]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[31]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[3]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[4]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[5]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[6]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[7]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[8]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext[9]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[0]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[10]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[11]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[12]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[13]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[14]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[15]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[16]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[17]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[18]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[19]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[1]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[20]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[21]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[22]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[23]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[24]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[25]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[26]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[27]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[28]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[29]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[2]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[30]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[31]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[32]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[33]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[34]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[35]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[36]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[37]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[38]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[39]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[3]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[40]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[41]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[42]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[43]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[44]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[45]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[46]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[47]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[48]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[49]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[4]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[50]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[51]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[52]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[53]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[54]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[55]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[56]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[57]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[58]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[59]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[5]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[60]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[61]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[62]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[63]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[6]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[7]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[8]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata_ext_2[9]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wen_ext}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wen_ext_2}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[0]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[10]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[11]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[12]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[13]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[14]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[15]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[16]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[17]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[18]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[19]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[1]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[20]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[21]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[22]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[23]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[24]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[25]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[26]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[27]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[28]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[29]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[2]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[30]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[31]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[3]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[4]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[5]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[6]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[7]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[8]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext[9]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[0]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[10]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[11]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[12]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[13]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[14]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[15]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[16]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[17]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[18]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[19]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[1]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[20]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[21]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[22]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[23]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[24]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[25]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[26]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[27]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[28]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[29]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[2]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[30]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[31]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[32]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[33]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[34]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[35]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[36]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[37]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[38]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[39]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[3]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[40]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[41]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[42]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[43]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[44]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[45]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[46]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[47]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[48]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[49]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[4]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[50]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[51]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[52]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[53]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[54]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[55]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[56]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[57]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[58]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[59]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[5]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[60]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[61]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[62]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[63]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[6]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[7]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[8]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata_ext_2[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {rdata_ext[31]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[30]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[29]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[28]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[27]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[26]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[25]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[24]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[23]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[22]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[21]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[20]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[19]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[18]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[17]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[16]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[15]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[14]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[13]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[12]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[11]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[10]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[9]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[8]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[7]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[6]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[5]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[4]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[3]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[2]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[1]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext[0]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[63]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[62]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[61]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[60]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[59]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[58]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[57]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[56]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[55]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[54]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[53]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[52]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[51]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[50]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[49]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[48]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[47]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[46]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[45]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[44]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[43]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[42]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[41]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[40]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[39]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[38]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[37]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[36]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[35]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[34]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[33]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[32]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[31]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[30]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[29]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[28]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[27]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[26]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[25]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[24]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[23]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[22]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[21]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[20]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[19]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[18]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[17]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[16]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[15]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[14]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[13]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[12]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[11]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[10]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[9]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[8]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[7]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[6]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[5]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[4]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[3]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[2]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[1]}]
set_load -pin_load 0.0334 [get_ports {rdata_ext_2[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {arst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {enable}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ren_ext}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ren_ext_2}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wen_ext}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wen_ext_2}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[63]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[62]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[61]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[60]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[59]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[58]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[57]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[56]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[55]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[54]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[53]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[52]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[51]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[50]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[49]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[48]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[47]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[46]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[45]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[44]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[43]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[42]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[41]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[40]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[39]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[38]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[37]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[36]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[35]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[34]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[33]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[32]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[63]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[62]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[61]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[60]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[59]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[58]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[57]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[56]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[55]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[54]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[53]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[52]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[51]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[50]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[49]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[48]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[47]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[46]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[45]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[44]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[43]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[42]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[41]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[40]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[39]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[38]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[37]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[36]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[35]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[34]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[33]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[32]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr_ext_2[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[63]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[62]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[61]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[60]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[59]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[58]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[57]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[56]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[55]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[54]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[53]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[52]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[51]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[50]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[49]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[48]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[47]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[46]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[45]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[44]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[43]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[42]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[41]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[40]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[39]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[38]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[37]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[36]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[35]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[34]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[33]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[32]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata_ext_2[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 30.0000 [current_design]
